Revit 2022 API
ViewSchedule Members
The ViewSchedule type exposes the following members.
Methods
Name | Description
AddFilter
 Adds a filter to the view.
 (Inherited from View.)
AllowsAnalysisDisplay
 Identifies if this view allows display of Analysis results.
 (Inherited from View.)
ApplyViewTemplateParameters
 Applies to this view the parameters of the input view that are not controlled by the current view template.
 (Inherited from View.)
AreGraphicsOverridesAllowed
 Determines if Visibility/Graphics Overriddes can be applied to the view.
 (Inherited from View.)
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanApplyColorFillScheme
 Checks if the id can be applied as the scheme id of specified category to this view.
 (Inherited from View.)
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanCategoryBeHidden
 Checks whether the category can be hidden in the view.
 (Inherited from View.)
CanCategoryBeHiddenTemporary
 Check if category can be temporarily hidden in the view.
 (Inherited from View.)
CanDeleteSubelement
 Checks if given subelement can be removed from the element.
 (Inherited from Element.)
CanEnableTemporaryViewPropertiesMode
 Indicates if Temporary View Properties mode can be applied for view in current state.
 (Inherited from View.)
CanGroupHeaders
 Indicates if selected headers can be grouped for this schedule.
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
CanModifyDetailLevel
 Check if Detail Level can be modified.
 (Inherited from View.)
CanModifyDisplayStyle
 Indicates if DisplayStyle can be modified.
 (Inherited from View.)
CanModifyViewDiscipline
 Indicates if the View Discipline can be modified
 (Inherited from View.)
CanUngroupHeaders
 Indicates if selected headers can be ungrouped.
CanUseDepthCueing
 Indicates if view can use Depth Cueing
 (Inherited from View.)
CanUseTemporaryVisibilityModes
 Indicates if view can use temporary visibility modes
 (Inherited from View.)
CanViewBeDuplicated
 Identifies if this view can be duplicated.
 (Inherited from View.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
ConvertTemporaryHideIsolateToPermanent
 Convert all temporary hidden elements or categories to permanently hidden in view.
 (Inherited from View.)
ConvertToIndependent
 Convert the dependent view to independent.
 (Inherited from View.)
CreateKeynoteLegend
 Creates a keynote legend.
CreateKeySchedule
 Create a key schedule.
CreateMaterialTakeoff
 Creates a material takeoff.
CreateNoteBlock
 Creates a note block.
CreateRevisionSchedule
 Creates a revision schedule.
CreateSchedule(Document, ElementId)
 Creates a regular schedule.
CreateSchedule(Document, ElementId, ElementId)
 Creates a regular schedule that can relate to a specific area scheme.
CreateSheetList
 Creates a sheet list.
CreateViewList
 Creates a view list.
CreateViewTemplate
 Creates a new view template instance from this view instance.
 (Inherited from View.)
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
DeleteSubelement
 Removes a subelement from the element.
 (Inherited from Element.)
DeleteSubelements
 Removes the subelements from the element.
 (Inherited from Element.)
DisableTemporaryViewMode
 Disables the specified temporary view mode.
 (Inherited from View.)
Dispose |  (Inherited from Element.)
Duplicate
 Duplicates this view.
 (Inherited from View.)
EnableRevealHiddenMode
 Enables Reveal Hidden elements mode.
 (Inherited from View.)
EnableTemporaryViewPropertiesMode
 Turns Temporary View Properties mode on or off. In this mode, any changes made to the view are temporary and will be discarded once the mode is disabled.
 (Inherited from View.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Export
 Exports the schedule data to a text file.
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetAvailableParameterCategories
 Get all available parameter categories.
 (Inherited from TableView.)
GetBackground
 Returns the current background set for the view.
 (Inherited from View.)
GetCalculatedValueName
 Gets the calculated value name for a cell from the template view.
 (Inherited from TableView.)
GetCalculatedValueText
 Gets the calculated value text for a cell from the instance view.
 (Inherited from TableView.)
GetCalloutParentId
 Gets ID of the callout parent view.
 (Inherited from View.)
GetCategoryHidden
 Checks if elements of the given category are set to be invisible (hidden) in this view.
 (Inherited from View.)
GetCategoryOverrides
 Gets graphic overrides for a category in view.
 (Inherited from View.)
GetCellText
 Gets the cell's text based on its type
 (Inherited from TableView.)
GetColorFillSchemeId
 Returns id of the color fill scheme element applied to the view.
 (Inherited from View.)
GetCropRegionShapeManager
 Returns an object for managing view crop region shape.
 (Inherited from View.)
GetDefaultNameForKeynoteLegend
 Gets the default view name that will be used when creating a keynote legend.
GetDefaultNameForKeySchedule
 Gets the default view name that will be used when creating a key schedule.
GetDefaultNameForMaterialTakeoff
 Gets the default view name that will be used when creating a material takeoff.
GetDefaultNameForNoteBlock
 Gets the default view name that will be used when creating a note block.
GetDefaultNameForRevisionSchedule
 Gets the default view name that will be used when creating a revision schedule.
GetDefaultNameForSchedule(Document, ElementId)
 Gets the default view name that will be used when creating a regular schedule.
GetDefaultNameForSchedule(Document, ElementId, ElementId)
 Gets the default view name that will be used when creating a schedule.
GetDefaultNameForSheetList
 Gets the default view name that will be used when creating a sheet list.
GetDefaultNameForViewList
 Gets the default view name that will be used when creating a view list.
GetDefaultParameterNameForKeySchedule
 Gets the default parameter name that will be used when creating a key schedule.
GetDependentElements
 Get all elements that, from a logical point of view, are the children of this Element.
 (Inherited from Element.)
GetDependentViewIds
 Get the ids of dependent views.
 (Inherited from View.)
GetDepthCueing
 Returns the current depth cueing settings for the view.
 (Inherited from View.)
GetDirectContext3DHandleOverrides
 Returns DirectContext3D handle overrides object for the view.
 (Inherited from View.)
GetElementOverrides
 Gets graphic overrides for an element in the view.
 (Inherited from View.)
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetFilterOverrides
 Gets graphic overrides that a filter applies to the view.
 (Inherited from View.)
GetFilters
 Gets the filters applied to the view.
 (Inherited from View.)
GetFilterVisibility
 Gets the visibility of the elements associated with a filter.
 (Inherited from View.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetIsFilterEnabled
 Identifies if the filter is enabled in this view.
 (Inherited from View.)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetNonControlledTemplateParameterIds
 Returns a list of parameters that are not marked as included when this view is used as a template.
 (Inherited from View.)
GetOrderedFilters
 Gets the filters applied to the view in the order they are applied.
 (Inherited from View.)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameter
Retrieves a parameter from the element given identifier.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetPointCloudOverrides
 Returns point cloud overrides object for the view.
 (Inherited from View.)
GetPrimaryViewId
 Get the id of the primary view.
 (Inherited from View.)
GetReferenceCallouts
 Returns element ids of all reference callouts in the view.
 (Inherited from View.)
GetReferenceElevations
 Returns element ids of all reference elevations in the view.
 (Inherited from View.)
GetReferenceSections
 Returns element ids of all reference sections in the view.
 (Inherited from View.)
GetSketchyLines
 Returns the current sketchy lines settings for the view.
 (Inherited from View.)
GetStripedRowsColor
 Gets the color applied to part of the pattern for a schedule with striped rows.
GetSubelements
 Returns the collection of element subelements.
 (Inherited from Element.)
GetTableData
 Gets the writable table data object.
GetTemplateParameterIds
 Returns a list of parameter ids that may be controlled when this view is assigned as a template.
 (Inherited from View.)
GetTemporaryViewPropertiesId
 When Temporary View Properties mode is in progress it provides view id that overrode settings for current view. Outside Temporary View Properties mode InvalidElementId will be returned.
 (Inherited from View.)
GetTemporaryViewPropertiesName
 When Temporary View Properties mode is in progress, name of applied template is returned. Outside Temporary View Properties mode, empty string will be returned.
 (Inherited from View.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidCategoriesForKeySchedule
 Gets a list of categories that can be used for a key schedule.
GetValidCategoriesForMaterialTakeoff
 Gets a list of categories that can be used for a material takeoff.
GetValidCategoriesForSchedule
 Gets a list of categories that can be used for a regular schedule.
GetValidFamiliesForNoteBlock
 Gets a list of families that can be used for a note block.
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
GetViewDisplayModel
 Returns the current view display model settings for the view.
 (Inherited from View.)
GetWorksetVisibility
 Returns the visibility settings of a workset for this particular view.
 (Inherited from View.)
GetWorksharingDisplayMode
 Gets the current worksharing display mode for this view.
 (Inherited from View.)
GroupHeaders
 Groups schedule header cells.
HasDetailLevel
 Check if the view has a Detail Level property
 (Inherited from View.)
HasDisplayStyle
 Indicates if view has a DisplayStyle property
 (Inherited from View.)
HasImageField
 Checks whether the schedule definition includes any image-related fields and if any elements in the schedule actually have images in those fields.
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
HasViewDiscipline
 Indicates if the view has a Discipline property
 (Inherited from View.)
HideActiveWorkPlane
Hide the active work plane of the view.
 (Inherited from View.)
HideCategoriesTemporary
 Set multiple categories to be temporarily hidden in the view.
 (Inherited from View.)
HideCategoryTemporary
 Set one category to be temporarily hidden in the view.
 (Inherited from View.)
HideElements
Sets the elements to be hidden in the view.
 (Inherited from View.)
HideElementsTemporary
 Set multiple elements to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input.
 (Inherited from View.)
HideElementTemporary
 Set one element to be temporarily hidden in the view. To hide a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
 (Inherited from View.)
IsCategoryOverridable
 Checks whether the category can have graphic overrides in this view.
 (Inherited from View.)
IsCreatedPhaseOrderValid
 Returns true if createdPhaseId and demolishedPhaseId are in order.
 (Inherited from Element.)
IsDataOutOfDate
 Indicates whether the schedule data is out of date.
IsDemolishedPhaseOrderValid
 Returns true if createdPhaseId and demolishedPhaseId are in order.
 (Inherited from Element.)
IsElementVisibleInTemporaryViewMode
 Identifies if the input element is visible for the temporary view mode for this view.
 (Inherited from View.)
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsFilterApplied
 Indicates if a filter is applied to the view.
 (Inherited from View.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsInTemporaryViewMode
 Returns true if the view is in a particular temporary view mode.
 (Inherited from View.)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsolateCategoriesTemporary
 Set categories to be temporarily isolated in the view.
 (Inherited from View.)
IsolateCategoryTemporary
 Set one category to be temporarily isolated in the view.
 (Inherited from View.)
IsolateElementsTemporary
 Set multiple elements to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input.
 (Inherited from View.)
IsolateElementTemporary
 Set one element to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
 (Inherited from View.)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsTemporaryHideIsolateActive
 Indicates if the view is temporarily hiding or isolating elements or categories.
 (Inherited from View.)
IsTemporaryViewPropertiesModeEnabled
 Returns true when Temporary View Properties mode is in progress, false otherwise.
 (Inherited from View.)
IsValidCategoryForKeySchedule
 Checks whether a category can be used for a key schedule.
IsValidCategoryForMaterialTakeoff
 Checks whether a category can be used for a material takeoff.
IsValidCategoryForSchedule
 Checks whether a category can be used for a regular schedule.
IsValidFamilyForNoteBlock
 Checks whether a family can be used for a note block.
IsValidSectionType
 Identifies if the section type is valid for this view.
 (Inherited from TableView.)
IsValidTextTypeId
 Identifies if the input id represents a valid text type id for use in the schedule properties.
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
IsValidViewTemplate
 Verifies that the view represented by templateId can be set as the controlling view template for this view.
 (Inherited from View.)
IsViewValidForTemplateCreation
 Verifies that the view is valid for template creation.
 (Inherited from View.)
IsWorksetVisible
 Indicates whether the workset is visible in this view.
 (Inherited from View.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
Print()
Print this view with the default view template and using the print setting of the current active document.
 (Inherited from View.)
Print(Boolean)
Print this view with the default view template, and either the view's document's print setting or the print setting of the current active document.
 (Inherited from View.)
Print(View)
Print this view with the given view template and using the print setting of the current active document.
 (Inherited from View.)
Print(View, Boolean)
Print this view with the given view template, and either the view's document's print setting or the print setting of the current active document.
 (Inherited from View.)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
RefreshData
 Rebuilds the schedule data if it is out of date.
RemoveCalloutParent
 Replaces callout parent ID with InvalidElementId.
 (Inherited from View.)
RemoveFilter
 Removes a filter from the view.
 (Inherited from View.)
RestoreCalloutParent
 Restores callout parent ID to the original view ID if that view is still available.
 (Inherited from View.)
RestoreImageSize
 Restores all images to their original sizes.
SetBackground
 Sets the background for the view. Background can only be set for 3d views and for Sections/Elevations.
 (Inherited from View.)
SetCategoryHidden
 Sets if elements of the given category will be visible in this view.
 (Inherited from View.)
SetCategoryOverrides
 Sets graphic overrides for a category in view.
 (Inherited from View.)
SetColorFillSchemeId
 Applies color fill scheme to this view.
 (Inherited from View.)
SetDepthCueing
 Sets the depth cueing settings for the view.
 (Inherited from View.)
SetElementOverrides
 Sets graphic overrides for an element in the view.
 (Inherited from View.)
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
SetFilterOverrides
 Sets the overrides associated with a filter.
 (Inherited from View.)
SetFilterVisibility
 Sets the visibility of the elements associated with a filter.
 (Inherited from View.)
SetIsFilterEnabled
 Sets the filter enabled flag.
 (Inherited from View.)
SetNonControlledTemplateParameterIds
 Sets the parameters that will not be included when this view is used as a template.
 (Inherited from View.)
SetSketchyLines
 Sets the sketchy lines settings for the view.
 (Inherited from View.)
SetStripedRowsColor
 Sets the color applied to part of the pattern for a schedule with striped rows.
SetViewDisplayModel
 Sets the view display model settings for the view.
 (Inherited from View.)
SetWorksetVisibility
 Sets visibility for a workset in this view.
 (Inherited from View.)
SetWorksharingDisplayMode
 Sets the worksharing display mode for this view.
 (Inherited from View.)
ShowActiveWorkPlane
Show the active work plane of the view.
 (Inherited from View.)
SupportedColorFillCategoryIds
 Returns collection of all category ids that correspond to elements that can potentially be colored in this view according to a color fill scheme. The set may be different depending on the view type.
 (Inherited from View.)
SupportsRevealConstraints
 Checks that the view can have the Reveal Constraints mode activated.
 (Inherited from View.)
SupportsWorksharingDisplayMode
 Checks whether this view supports the given worksharing display mode.
 (Inherited from View.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UngroupHeaders
 Ungroups selected headers of schedule.
UnhideElements
Sets the elements to be shown in the given view if they are currently hidden.
 (Inherited from View.)
Properties
Name | Description
AnalysisDisplayStyleId
 Element id of Analysis Display Style associated with the view.
 (Inherited from View.)
AreAnalyticalModelCategoriesHidden
 Indicates if analytical model categories are currently hidden in the view.
 (Inherited from View.)
AreAnnotationCategoriesHidden
 Indicates if annotation categories are currently hidden in the view.
 (Inherited from View.)
AreCoordinationModelHandlesHidden
 Indicates if Coordination Model handles are currently hidden in the view.
 (Inherited from View.)
AreImportCategoriesHidden
 Indicates if import categories are currently hidden in the view.
 (Inherited from View.)
AreModelCategoriesHidden
 Indicates if model categories are currently hidden in the view.
 (Inherited from View.)
ArePointCloudsHidden
 Indicates if point clouds are currently hidden in the view.
 (Inherited from View.)
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
AssociatedAssemblyInstanceId
 The Id of the assembly instance that owns the assembly view.
 (Inherited from View.)
BodyTextTypeId
 Defines the default text style used for the data section of the schedule.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CanBePrinted
Test whether the view can be printed.
 (Inherited from View.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
CropBox
The Crop Box applied to the view, or an outline encompassing the crop region applied to the view.
 (Inherited from View.)
CropBoxActive
Whether or not the Crop Box/Region is active for the view.
 (Inherited from View.)
CropBoxVisible
Whether or not the Crop Box/Region is visible for the view.
 (Inherited from View.)
Definition
 The primary ScheduleDefinition.
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
DetailLevel
 The detail level of this view.
 (Inherited from View.)
Discipline
 The Discipline of the view.
 (Inherited from View.)
DisplayStyle
 The DisplayStyle of the view. Returns DisplayStyle.Wireframe if the view has no display style.
 (Inherited from View.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
EmbeddedDefinition
 The embedded ScheduleDefinition.
GenLevel
The level for the view.
 (Inherited from View.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
HasStripedRows
 Indicates whether this schedule has striped rows.
HeaderTextTypeId
 Defines the default text style used in the column headers in the body section of the schedule.
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
ImageRowHeight
 Defines the image row height in the schedule.
IsAssemblyView
 Indicates if the view is assembly view.
 (Inherited from View.)
IsCallout
 Indicates if the view is a callout view.
 (Inherited from View.)
IsHeaderFrozen
 A static property defining if the schedule header frozen setting is turned on or off in current Revit Application Session.
IsInternalKeynoteSchedule
 Identifies if this ViewSchedule is an internal schedule used when keynotes are filtered based on the elements that are shown on a sheet.
IsTemplate
Test whether the view is a view template.
 (Inherited from View.)
IsTitleblockRevisionSchedule
 Identifies if this ViewSchedule is an internal schedule used to display revision schedules as part of a titleblock.
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
KeyScheduleParameterName
 In a key schedule, the name of the parameter for choosing one of the keys.
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
MaximumColumnWidth
 Gets the maximum column width
 (Inherited from TableView.)
MaximumGridWidth
 Gets the allowed maximum grid width
 (Inherited from TableView.)
MaximumRowHeight
 Gets the maximum row height
 (Inherited from TableView.)
MinimumColumnWidth
 Gets the minimum column width
 (Inherited from TableView.)
MinimumRowHeight
 Gets the minimum row height
 (Inherited from TableView.)
Name
A human readable name for the Element.
 (Inherited from Element.)
Origin
Returns the origin of the screen.
 (Inherited from View.)
Outline
The bounds of the view in paper space (in feet).
 (Inherited from View.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
PartsVisibility
 The visibility setting for parts in this view.
 (Inherited from View.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
RevealConstraintsMode
 Indicates whether the Reveal Constraints mode is activated in the view.
 (Inherited from View.)
RightDirection
The direction towards the right side of the screen.
 (Inherited from View.)
Scale
The scale of the view.
 (Inherited from View.)
ShadowIntensity
 The intesity of cast shadows - 0 = no shadows, 100 = black.
 (Inherited from View.)
SketchPlane
The sketch plane assigned to the view for model curve creation.
 (Inherited from View.)
SunAndShadowSettings
The sun and shadow settings assigned to the view for shadow calculation and rendering.
 (Inherited from View.)
SunlightIntensity
 The intensity of the simulated (directional) sunlight. 0 = no directional light; maximum value is 100.
 (Inherited from View.)
TargetId
 the element id of the element that is being viewed
 (Inherited from TableView.)
TemporaryViewModes
 Data of temporary view modes associated with this view.
 (Inherited from View.)
Title
 The view title. This consists of the view name plus other modifiers, such as the view type, sheet number, area scheme, and/or assembly type, depending on the specifics of the view.
 (Inherited from View.)
TitleTextTypeId
 Defines the default text style used in the header section of the schedule.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UpDirection
The direction towards the top of the screen.
 (Inherited from View.)
UseStripedRowsOnSheets
 Indicates whether a property setting of true will also change the display of this schedule to show striped rows on a sheet. If true, setting that property to true will also change the display. If false, striped rows will not display for this schedule on a sheet no matter what value is set for HasStripedRows.
VersionGuid
 Get the element version Guid.
 (Inherited from Element.)
ViewDirection
The direction towards the viewer.
 (Inherited from View.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
ViewTemplateId
 The id of the template view that controls this view's parameters.
 (Inherited from View.)
ViewType
The type of the view.
 (Inherited from View.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace